
## Plan Result (prod)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et_acas_subscription_secondary_key
* Update
  * azurerm_api_management_subscription.et_acas_subscription
  * azurerm_api_management_user.et_api_management_user


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "et_acas_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/6d3fecbd-0e37-48b9-bbda-c2c4664b3871"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_user.et_api_management_user will be updated in-place
  ~ resource "azurerm_api_management_user" "et_api_management_user" {
      ~ email               = "Peter.Moores@hmcts.net" -> "Harpreet.Jhita@justice.gov.uk"
      ~ first_name          = "Peter" -> "Harpreet"
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/users/5931a75ae4bbd512288c888c"
      ~ last_name           = "Moores" -> "Jhita"
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.et_acas_subscription_secondary_key will be created
  + resource "azurerm_key_vault_secret" "et_acas_subscription_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-sya-api-prod/providers/Microsoft.KeyVault/vaults/et-sya-api-prod"
      + name                    = "etacas-subscription-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1276,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->